from userbot.Config import Config # Ok
# for update code when i need it
HEROKU_APP_NAME = Config.HEROKU_APP_NAME or None
HEROKU_API_KEY = Config.HEROKU_API_KEY or None
UPSTREAM_REPO_BRANCH = Config.UPSTREAM_REPO_BRANCH
UPSTREAM_REPO = "https://github.com/Zed-Thon/ZED_USERBOT"
T = Config.COMMAND_HAND_LER

Up_1 = "𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 @xvwwvl - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n** ⪼ يوجـد تحـديث جديد لسورس زد ثـون ༗.**\n`{}`\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n 𓆰 𝙎𝙊𝙐𝙍𝘾𝞝 𝘿𝙀𝙑 - @xvwwvl 𓆪"
Up_2 = "**تنصيب تحديث زد ثـون قيد التقدم ، يرجى الانتظار حتى تنتهي العملية ، وعادة ما يستغرق التحديث من 4 إلى 5 دقائق.**"
Up_3 = "𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 @xvwwvl - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**⪼ تم التحديث بنجاح ✅**\n ** جارٍ إعادة تشغيل بوت زد ثـون ، انتظر 𓆰.**"
Up_4 = "𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 @xvwwvl - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**⪼ جاري البحث عن التحديثات  🌐.. 𓆰،**"
Up_5 = "𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 @xvwwvl - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**⪼ يتم تنصيب التحديث  انتظر 🌐 𓆰،**"
Up_6 = "𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 @xvwwvl - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**⪼ يتم تحديث بوت زد ثـون انتظر 🌐..𓆰،**"

Upeor_1 = "بيانات اعتماد هيروكو غير صالحة لتنصيب زد ثـون"
Upeor_2 = "`عفوًا .. لا يمكن لبرنامج التحديث المتابعة بسبب "
Upeor_3 = "حدثت بعض المشاكل`\n\n**تتبع السجل:**\n"
Upeor_4 = "𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 @xvwwvl - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n** ⪼ اضبط المتغيرات المطلوبة أولاً لتحديث بوت زد ثـون 𓆰،**",

Upend = "\n𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 @xvwwvl - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n**⪼ سورس زد ثـون محدث لأخر اصدار ༗. **"
UpMsg =  f"𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 @xvwwvl - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n⪼ اضغط هنا **للتحديث السريع ↫ **[`{T}تحديث الان`] او اضغط هنا **لتنصيب التحديث** وقد يستغرق 5 دقائق ↫ [`{T}تحديث البوت`]"
